app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.user = current_user

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "body", "completed", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Побігати"], ["body", "Побігати"], ["completed", 0], ["user_id", 1], ["created_at", "2023-05-04 13:13:00.168964"], ["updated_at", "2023-05-04 13:13:00.168964"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "body" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["body", "Не менше годинииии"], ["updated_at", "2023-05-04 16:38:39.589799"], ["id", 5]]